/*
 *  This Small Math module is heavily inspired by HandMadeMath to the point its like a 
 *  small subset of the original HandMadeMath lib (ignoring the simd stuff tho)
 *  Not focusing on SimD for now as its omething i want to learn before implemnting and do it myself
 * 
 *  Though one thing different from Handmade math is taht we have a row major storage and column vectore convention
 *  as opposed to the column major storage in HandmadeMath
 *    - Storage: row-major
 *    - Vectors: column vectors
 *    - Coordinate system: right-handed
 *    - Angles: radians
 *    - Transform order: M = T * R * S
 *    - Multiplication: v' = M * v
 *  ===========================================================================================
 *
 *  Ref HandMadeMath repo :- https://github.com/HandmadeMath/HandmadeMath/tree/master#
 *      - License :- MIT
 * */


#ifndef VEC_H
#define VEC_H

#include <math.h>
#include <stdbool.h>

#include "compiler.h"
#include "types.h"

#ifdef VEC_IMPLEMENTATION
    #define VEC_DEF
#else
    #define VEC_DEF static FORCE_INLINE
#endif

#define PI 3.14159265358979323846
#define PI32 3.14159265359f
#define DEG180 180.0
#define DEG18032 180.0f
#define TURNHALF 0.5
#define TURNHALF32 0.5f
#define RadToDeg ((float)(DEG180/PI))
#define RadToTurn ((float)(TURNHALF/PI))
#define DegToRad ((float)(PI/DEG180))
#define DegToTurn ((float)(TURNHALF/DEG180))
#define TurnToRad ((float)(PI/TURNHALF))
#define TurnToDeg ((float)(DEG180/TURNHALF))

#ifdef STRICT_MAX_MIN
    #define MAX(a, b) MAX_ST((a),(b))
    #define MIN(a, b) MIN_ST((a),(b))
#else
    #define MAX(a,b)  ((a > b) ? a : b)
    #define MIN(a,b)  ((a < b) ? a : b)
#endif

#define ABS(a)    ((a) > 0 ? (a) : -(a))
#define MOD(a, m) (((a) % (m)) >= 0 ? ((a) % (m)) : (((a) % (m)) + (m)))
#define SQUARE(x) ((x) * (x))

#define F32_EPSILON 1e-6f
#define NORMALIZE_EPSILON 1e-6f

typedef union {
    struct {
        f32 x, y;
    };

    struct {
        f32 u, v;
    };

    struct {
        f32 left, right;
    };

    struct {
        f32 width, height;
    };

    f32 data[2];
} Vec2;
STATIC_ASSERT((sizeof(Vec2) == 8), "Size of Vec3 must be 8 bytes");

typedef union {
    struct {
        f32 x, y, z;
    };

    struct {
        f32 r, g, b;
    };

    struct {
        f32 u, v, w;
    };
    
    struct {
        Vec2 xy;
        f32 _Ignored0;
    };

    struct {
        f32 _Ignored1;
        Vec2 yz;
    };

    struct {
        Vec2 uv;
        f32 _Ignored2;
    };

    struct {
        f32 _Ignored3;
        Vec2 vw;
    };

    f32 data[3];
} Vec3;
STATIC_ASSERT((sizeof(Vec3) == 12), "Size of Vec3 must be 12 bytes");

typedef union {
    struct {
        union {
            Vec3 xyz;
            struct {
                f32 x, y, z;
            };
        };

        f32 w;
    };

    struct {
        union {
            Vec3 rgb;
            struct {
                f32 r, g, b;
            };
        };

        f32 a;
    };

    struct {
        Vec2 xy;
        f32 _Ignored0;
        f32 _Ignored1;
    };

    struct {
        f32 _Ignored2;
        Vec2 yz;
        f32 _Ignored3;
    };

    struct {
        f32 _Ignored4;
        f32 _Ignored5;
        Vec2 zw;
    };

    f32 data[4];
} Vec4;
STATIC_ASSERT((sizeof(Vec4) == 16), "Size of Vec4 must be 16 bytes");

typedef union {
    f32 elems[2][2];
    Vec2 rows[2];
} Mat2;
STATIC_ASSERT((sizeof(Mat2) == 16), "Size of Mat2 must be 16 bytes");

typedef union {
    f32 elems[3][3];
    Vec3 rows[3];
} Mat3;
STATIC_ASSERT((sizeof(Mat3) == 36), "Size of Mat3 must be 36 bytes");

typedef union {
    f32 elems[4][4];
    Vec4 rows[4];
}Mat4;
STATIC_ASSERT((sizeof(Mat4) == 64), "Size of Mat4 must be 64 bytes");

#define vec2(_x,_y)         (Vec2){.x = (_x), .y = (_y)}
#define vec3(_x,_y,_z)      (Vec3){.x = (_x), .y = (_y), .z = (_z)}
#define vec4(_x,_y,_z,_w)   (Vec4){.x = (_x), .y = (_y), .z = (_z), .w = (_w)}
#define vec4V(_v3, _w)      (Vec4){.xyz = (_v3), .w = (_w)}
#define mat2(void)          (Mat2){0}
#define mat3(void)          (Mat3){0}
#define mat4(void)          (Mat4){0}

VEC_DEF bool NearlyEqualF32(f32 left, f32 right) {
    f32 diff = fabsf(left - right);
    if (diff <= F32_EPSILON) {
        return true;
    }

    f32 largest = fmaxf(fabsf(left), fabsf(right));
    return diff <= largest * F32_EPSILON;
}

VEC_DEF bool NearlyEqualV2(Vec2 left, Vec2 right) {
    return NearlyEqualF32(left.x, right.x) &&
           NearlyEqualF32(left.y, right.y);
}

VEC_DEF bool NearlyEqualV3(Vec3 left, Vec3 right) {
    return NearlyEqualF32(left.x, right.x) &&
           NearlyEqualF32(left.y, right.y) &&
